// scope არის კოდის მუშაობის არეალი. scope-ების სახეებია block scope, global scope.
// block scope იგივე კოდის ბლოკში ჩაწერილი კოდია. block scope მაგალითად ბლოკავს ცვლადებს, კოდის ბლოკის გარეთ მას ვერ გამოიძახებ. 
// global scope არის კოდი რომელიც კოდის ბლოკში არაა, სულ გარეთ არის და global scope-ში შექმნილი ცვლადის გამოძახება კოდის ბლოკში შეგვიძლია.
// window ობიექტის საშუალებით მუშაობს ბრაუზერი.
// scope pollution ნიშნავს, რომ კოდში scope-ების არეულობაა. მაგ: global scope-ში ისეთი ცვლადია შექმნილი რომელიც მარტო 1 რამისთვის გვჭირდება (ეს ცვლადი კოდის ბლოკში უნდა იყოს)
