# string არის ტექსტის ტიპი, რომელიც ბრჭყალებში იწერება. მაგ: "Hello"
# integer არის მთელი რიცხვები მაგ: 9
# float არის ათწილადი რიცხვები მაგ : 2.5

# კოდის გასწორებული ფორმა
number = 10
word = "car"
print(number)
print(word)

word = "boat"
number = 10
print(word + number)
# ამ კოდმა შეცდომა გამოიტანა, რადგან string და integer არ ჯამდება, რადგან სხვადასხვა ტექსტის ტიპებია.

print(5 + 5)
print("5" + "5")
# პირველ print ფუნქციაში ორივე integer, ანუ მთელი რიცხვებია, ამიტომ ჩვეულებრივად რიცხვები დაჯამდება. 
# მეორე print ფუნქციის შემთხვევაში, ორივე string არის, ანუ ტექსტი რომელიც ბრჭყალებში იწერება, რაც იმას ნიშნავს, რომ მათემატიკურად არ დაჯამდება, არამედ ერთმანეთის გვერდით დაიწერება.