/*
rest არის ოპერატორი, რომელიც გვეხმარება ფუნქციის სწორად შექმნაში. rest ოპერატორ გამოიყენება ფუნქციის პარამეტრში, მაგ თუ პირდაპირ დაწერ ...cvladi, რამდენი არგუმენტიც
არ უნდა გადასცე მაგ ფუნქციას ეგ არგუმენტები მაგ ცვლადში, სიაში შეინახება.

spread არის ოპერატორი, რომელიც გვეხმარება სიიდან, ობიექტიდან ელემენტების წამოღებაში. ის განსაკუთრებით კარგია მაშინ, როცა ახალ ცვლადს ქმნი და რაღაც სიის იგივე მონაცემები გჭირდება,
პირდაპირ ცვლადის გადაცემის მაგივრად უნდა გამოიყენო spread, რომ ერთიდაიგივე მისამართი არ ქონდეთ და ერთ-ერთი ცვლადის შეცვლამ მეორე ცვლადის შეცვლაც არ გამოიწვიოს.

*/

function idk(...n){
    return (n.reduce((acc, cur) => {
        return acc + cur
    }, 0))
    
}

console.log(idk(1, 2, 3, 4, 5))

let array = [1, 2, 3, 4, 5]

let idkk = {
    name: "gabro",
    age: 15
}

let newArray = [...array]

let newIdkk = {
    ...idkk
}

console.log(newArray)
console.log(newIdkk)