# ფუნქცია არის კოდის ბლოკი, რომლის გამოყენებაც შეგვიძლია რამდენჯერაც გამოვიძახებთ. ფუნქციის შესაქმნელად საჭიროა def keyword, def-ის მერე ფუნქციის სახელი, : და ინდენტაციაში დაწერილი კოდი. ფუნქცია რომ გამოვიძახოთ, უნდა დავწეროთ ფუნქციის სახელი და ფრჩხილები.
def test():
    return "nebismieri winadadeba"

test()
# ამ ფუნქციამ ტერმინალში შედეგი არ გამოიტანა, რადგან return keyword პასუხს აბრუნებინებს, მაგრამ ტერმინალში არა. print() ფუნქციაში რომ ჩავსვამთ ამ ფუნქციას მაშინ დაიბეჭდება შედეგი ტერმინალში.
test()
test()
test()


def test1():
    jami = 0
    for i in range(5):
        jami += int(input())
    return jami/5
    
print(test1())


def sayhi():
    return "hello, gabriel lebanidze"