# სია არის ცვლადისთვის ბევრი მნიშვნელობის მინიჭება. სიის მაგ: name = ["giorgi", "gabrieli", "konstantine"]
# ინდექსი გვიჩვენებს ჩამონათვალში რომელი მერამდენეა. ინდექსის ათვლა იწყება 0-დან. ინდექსის გამოყენებით შეგვიძლია სიაში მნიშვნელობებს ადგილები გავუცვალოთ. მაგ:
name = ["giorgi", "gabrieli", "konstantine"]
name[0], name[1] = name[1], name[0]

# ინდექსის გამოყენებით შეგიძლია დაბეჭდო სიაში მერამდენე მნიშვნელობასაც აირჩევ. მაგ:

number = [1, 2, 3,]
print(number[0])

# ინდექსის გამოყენებით შეგიძლია string-იდან რომელიმე ასო დაბეჭდო. მაგ:
name="salome"
print(name[0])